Revit 2024 API
ElectricalEquipment.SetCircuitNamingSchemeType Method
 Sets the circuit naming scheme for Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
Visual Basic
Public Sub SetCircuitNamingSchemeType ( _
	circuitNamingType As CircuitNaming _
)
Visual C++
public:
void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
Parameters
circuitNamingType
Type: Autodesk.Revit.DB.Electrical.CircuitNaming
 The enumerated type of circuit naming scheme to be set.
Remarks
The following circuit naming scheme type can be set:
CircuitNaming::Prefixed
CircuitNaming::Standard
CircuitNaming::PanelName
CircuitNaming::Phase
CircuitNaming::ProjectSetting
For a customized circuit naming scheme, set its id directly with SetCircuitNamingSchemeId method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The circuit naming scheme enumerated type is invalid for the Electrical Equipment.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace